import datetime

DictHours = {1:{0:"ноль часов", 1:"один час", 2:"два часа", 3:"три часа", 4:"четыре часа", 5:"пять часов", 6:"шесть часов", 7:"семь часов", 8:"восемь часов", 9:"девять часов", 10:"десять часов", 11:"одинадцать часов", 12:"двенадцать часов", 13:"ровно"},
 2:{1:"первого", 2:"второго", 3:"третьего", 4:"четвертого", 5:"пятого", 6:"шестого", 7:"седьмого", 8:"восьмого", 9:"девятого", 10:"десятого", 11:"одинадцатого", 12:"двенадцатого"}}

DictMin = {0:"минут", 1:"одна минута", 2:"две минуты", 3:"три минуты", 4:"четыре минуты", 5:"пять минут", 6:"шесть минут", 7:"семь минут", 8:"восемь минут", 9:"девять минут", 10:"десять минут", 11:"одинадцать минут", 12:"двенадцать минут",
 13:"тринадцать минут", 14:"четырнадцать минут", 15:"пятьнадцать минут", 16:"шестьнадцать минут", 17:"семьнадцать минут", 18:"восемьнадцать минут", 19:"девятьнадцать минут", 20:"двадцать", 31:"тридцать", 41:"сорок",
 59:"одной минуты", 58:"двух минут", 57:"трёх минут", 56:"четырёх минут", 55:"пяти минут", 54:"шести минут", 53:"семи минут", 52:"восьми минут", 51:"девяти минут", 50:"десяти минут", 49:"одинадцати минут", 48:"двенадцати минут", 47:"тринадцати минут" , 46:"четырнадцати минут", 45:"пятнадцати минут"}

Ttime = {0:"Время", 1:"Время половина", 2:"Время без"}

print("Программа которая распишет для вас время")

x=input("Добрый день выберите:\n 1.Расписать текущее время \n 2.Задать своё время\n 3.Выход из программы\n")
flag = False

while flag==False:

    if x=="1":
        
        h = datetime.datetime.now().hour 
        m = datetime.datetime.now().minute
        print(f"{datetime.datetime.now().hour}:{datetime.datetime.now().minute}")
        flag=True

    elif x=="2":
        UsTime=input("Введите время в формате чч:мм\n")
        while flag == False:
            if (len(UsTime)==5 and int(UsTime[0:2])<=24 and int(UsTime[0:2])>=0 and int(UsTime[3:5])<=59 and int(UsTime[0:2])>=0 and UsTime[2]==":"):
                h = int(UsTime[0:2])
                m = int(UsTime[3:5])
                flag = True

            else:
                UsTime=input("Неверные данные  :e\nВведите время в формате чч:мм\nДля выхода нажмите цифру 3\n")
                if UsTime=="3":
                    exit()  
    elif x=="3":
        exit()
    
    else:
        x=input("Вы ввели неверные данные.\nВводите 1 или 2\n")
            
if h>=12:
    h=h-12

if m==0:
    print(f"{Ttime[0]} {DictHours[1][h]} {DictHours[1][m+13]}\n")
    
elif m==30:   
    print(f"{Ttime[1]} {DictHours[2][h+1]}\n")

elif m<30:

    if m<20:
        print(f"{Ttime[0]} {DictMin[m]} {DictHours[2][h+1]}\n")
    elif (m>=20 and m<30):
        print(f"{Ttime[0]} {DictMin[20]} {DictMin[m-20]} {DictHours[2][h+1]}\n")
  
elif (m>30 and m<45):
    if m<40:
        print(f"{Ttime[0]} {DictMin[31]} {DictMin[m-30]} {DictHours[2][h+1]}\n")
        
    else:
        print(f"{Ttime[0]} {DictMin[41]} {DictMin[m-40]} {DictHours[2][h+1]}\n")        
else:
    print(f"{Ttime[2]} {DictMin[m]} {DictHours[1][h+1]}\n")
    