hours_tokens = {0:['ноль', 'первого', 'час'],
               1:['час', 'второго', 'два']}


minutes_tokens = {0:["ровно"],
                  1:['одна', 'одной'],
                  2:[],
                  3:[],
                  4:[],
                  5:[],
                  6:[],
                  7:[],
                  8:[],
                  9:[],
                  10:[],
                  11:[],}

#1 2 3 4 5 6 7 8 9 10
#11 12 13 14 15 16 17 18 19 20
#30 40

#25 = minutes_tokens[20][0] + minutes_tokens[5][0]

minutes_words = ['минут', 'минуты']
hours_words = ['час', 'часа']