#ИЗВИНЯЮСЬ ЗА ЗАДЕРЖКУ. БЫЛ В БЕРЛИНЕ В КОММАНДИРОВКЕ
#Я ДОРАБОТАЮ СКОЛОНЕНИЕ МИНУТА/МИНУТЫ
import datetime

now = datetime.datetime.now()
hour = now.hour
minute = now.minute

dict_1 = {
    1: "час", 2: "два", 3: "три", 4: "четыре", 5: "пять", 6: "шесть",
    7: "семь", 8: "восемь", 9: "девять", 10: "десять", 11: "одинадцать", 12: "двенадцать",
    13: "час", 14: "два", 15: "три", 16: "четыре", 17: "пять", 18: "шесть",
    19: "семь", 20: "восемь", 21: "девять", 22: "десять", 23: "одинадцать", 0: "двенадцать",
}

dict_2 = {
    1: "первого", 2: "второго", 3: "третьего", 4: "четвертого", 5: "пятого", 6: "шестого",
    7: "седьмого", 8: "восьмого", 9: "девятого", 10: "десятого", 11: "одинадцатого", 12: "двенадцатого",
    13: "первого", 14: "второго", 15: "третьего", 16: "четвертого", 17: "пятого", 18: "шестого",
    19: "седьмого", 20: "восьмого", 21: "девятого", 22: "десятого", 23: "одинадцатого", 0: "двенадцатого",
}

dict_3 = {
    1: "одна", 2: "две", 3: "три", 4: "четыре", 5: "пять", 6: "шесть",
    7: "семь", 8: "восемь", 9: "девять", 10: "десять", 11: "одинадцать",
    12: "двенадцать", 13: "тринадцать", 14: "четырнадцать", 15: "пятнадцать",
    16: "шестнадцать", 17: "семнадцать", 18: "восемнадцать", 19: "девятнадцать",
    20: "двадцать", 30: "тридцать", 40: "сорок", 50: "пятьдесят", 0: "",
}

dict_4 = {
    15: "пятнадцати", 14: "четырнадцати", 13: "тринадцати", 12: "двенадцати",
    11: "одинадцати", 10: "десяти", 9: "девяти", 8: "восьми", 7: "семи",
    6: "шести", 5: "пяти", 4: "четырех", 3: "трех", 2: "двух", 1: "одной",
}

def time_text(hh, mm):
    #проверка
    if hh > 23 or mm > 59:
        print('Недопустимое время!\n')

    #ровно
    elif mm == 0 and hh != 1:
        print(f'{hh}:{mm} - {dict_1[hh]} часа ровно.')
    elif mm == 0 and hh == 1:
        print(f'{hh}:{mm} - {dict_1[hh]} ровно.\n')

    #сколько то минут
    elif mm <= 20:
        print(f'{hh}:{mm} - {dict_3[mm]} минут {dict_2[hh]}.\n')

    elif mm != 30 and 20 < mm < 45:
        mm_2 = mm % 10
        mm_1 = mm - mm_2
        print(f'{hh}:{mm} - {dict_3[mm_1]} {dict_3[mm_2]} минут {dict_2[hh]}.\n')

    #половина
    elif mm == 30:
        print(f'{hh}:{mm} - половина {dict_2[hh]}.\n')

    #без скольки то минут
    elif mm >= 45:
        mm_45 = 60 - mm
        print(f'{hh}:{mm} - без {dict_4[mm_45]} минут {dict_2[hh]}.\n')

while True:
    print('----Для выхода из программы введите x----')
    print('----Ввод любой буквы - текущее время----')
    answ = input('Если хотите вывести свое время введите - s: ')
    if answ == 's':
        time = input('Введите время в формате чч:мм: ')
        time = time.split(':')
        hour, minute = int(time[0]), int(time[1])
        time_text(hour, minute)
    elif answ == 'x':
        print('--------')
        break
    else:
        print('Текущее время:')
        time_text(hour, minute)