import datetime

choice = input(
    "Введите '1'- Для отображения текущего времени\nВведите '2'- Если хотите ввести время с консоли\n")

if not choice.isnumeric() or not 1 <= int(choice) <= 2:
    print("Некорректно введены данные, попробуйте снова")
    exit()

if int(choice) == 1:
    time = f"{datetime.datetime.now().hour}:{datetime.datetime.now().minute}"
else:
    time = input("Введите время в формате чч:мм:\n")
    if len(time) != 5 or time[2] != ':':
        print("Некорректно введены данные, попробуйте снова")
        exit()

hour, minute = time.split(':')[0], time.split(':')[1]
if not hour.isnumeric() or not minute.isnumeric() or not 0 <= int(hour) <= 24 or not 0 <= int(minute) < 60:
    print("Некорректно введены данные, попробуйте снова")
    exit()

m, h = int(minute), int(hour)
if h > 11:
    h = h - 12
d_h = {1: {0: "двенадцать", 1: "один", 2: "два", 3: "три", 4: "четыре", 5: "пять", 6: "шесть",
           7: "семь", 8: "восемь", 9: "девять", 10: "десять", 11: "одинадцать"},
       2: {0: "первого", 1: "второго", 2: "третьего", 3: "четвертого", 4: "пятого", 5: "шестого",
           6: "седьмого", 7: "восьмого", 8: "девятого", 9: "десятого", 10: "одиннадцатого", 11: "двенадцатого"}}
d_m = {0: "ровно", 1: "одна", 2: "две", 3: "три", 4: "четыре", 5: "пять", 6: "шесть", 7: "семь", 8: "восемь",
       9: "девять", 10: "десять", 11: "одинадцать", 12: "двенадцать", 13: "тринадцать", 14: "четырнадцать",
       15: "пятнадцать", 16: "шестнадцать", 17: "семнадцать", 18: "восемнадцать", 19: "девятнадцать",
       20: "двадцать", 21: "двадцать одна", 22: "двадцать две", 23: "двадцать три", 24: "двадцать четыре",
       25: "двадцать пять", 26: "двадцать шесть", 27: "двадцать семь", 28: "двадцать восемь",
       29: "двадцать девять", 30: "половина", 31: "тридцать одна", 32: "тридцать две", 33: "тридцать три",
       34: "тридцать четыре", 35: "тридцать пять", 36: "тридцать шесть", 37: "тридцать семь",
       38: "тридцать восемь", 39: "тридцать девять", 40: "сорок", 41: "сорок одна", 42: "сорок две",
       43: "сорок три", 44: "сорок четыре", 45: "пятнадцати", 46: "четырнадцати", 47: "тринадцати",
       48: "двенадцати", 49: "одинадцати", 50: "десяти", 51: "девяти", 52: "восьми", 53: "семи", 54: "шести",
       55: "пяти", 56: "четырех", 57: "трех", 58: "двух", 59: "одной"}

if m == 0:
    if h == 1:
        h_print = "час"
    elif 1 < h < 5:
        h_print = "часа"
    else:
        h_print = "часов"
    for_print = d_h[1][h] + " " + h_print + " " + d_m[m]
elif 0 < m < 45 and m != 30:
    if m % 10 == 1 and m != 11:
        m_print = "минута"
    elif 1 < m % 10 < 5 and not 11 < m < 15:
        m_print = "минуты"
    else:
        m_print = "минут"
    for_print = d_m[m] + " " + m_print + " " + d_h[2][h]
elif m == 30:
    for_print = d_m[m] + " " + d_h[2][h]
else:
    if m == 59:
        m_print = "минуты"
    else:
        m_print = "минут"
    for_print = "без " + d_m[m] + " " + m_print + " " + d_h[1][h]

print(time, "-", for_print)
